In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import sys
np.random.seed(12345)
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

### 실습 예제 1번
ex2.csv파일을 읽어와 헤더 이름을 x, y, z ,b, naju로 하시오

In [6]:
pd.read_csv('data/ex2.csv', names=['x', 'y', 'z', 'b', 'naju'])

   x   y   z   b   naju
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

### 실습 예제 2번
ex2.csv파일을 읽어와 헤더 이름으로할 list를 만들고 안에 값은 (one, two, three, four, d)로 하고  columns 중 d를 인덱스로 한다

In [7]:
names = ['one', 'two', 'three', 'four', 'd']
pd.read_csv('data/ex2.csv', names=names, index_col='d')

       one  two  three  four
d
hello    1    2      3     4
world    5    6      7     8
foo      9   10     11    12

### 실습 예제 3번
csv_mindex.csv파일을 읽어와 컬럼중에 value1와 value2를 색인으로 한다. 이름은 prat2로 한다

In [9]:
prat2 = pd.read_csv('data/csv_mindex.csv', index_col=['value1', 'value2'])
prat2

              key1 key2
value1 value2
1      2       one    a
3      4       one    b
5      6       one    c
7      8       one    d
9      10      two    a
11     12      two    b
13     14      two    c
15     16      two    d

### 실습 예제 4번
ex4.csv 파일을 불러와 0,2, 3, 4행을 삭제해보시오

In [10]:
pd.read_csv('data/ex4.csv', skiprows=[0, 2, 3, 4])

   a   b   c   d message
0  5   6   7   8   world
1  9  10  11  12     foo

### 실습 예제 5번
message 컬럼에 있는 world와  a열에 있는 5를 NaN으로 만들어 보시오

In [11]:
sentinels = {'message': ['world'], 'a': ['5']}
pd.read_csv('data/ex5.csv', na_values=sentinels)

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  NaN   6   NaN   8     NaN
2     three  9.0  10  11.0  12     foo

### 실습 예제 6번
data 파일을 prat3.csv파일로 출력해 보시오

In [13]:
data = pd.read_csv('data/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [14]:
data.to_csv('prat3.csv')

### 실습 예제 7번
data2라는 변수의 이름을 가졌고 2017/08/11 부터 6일뒤까지의 날짜를 가진 리스트를 만들어보시오
또한 prat3의 이름을 가졌고 리스트의 값을 색인으로 하는 시리즈를 만들 되 시리즈안의 값들은 0부터 순서대로 나타나게 하시오

In [15]:
dates2 = pd.date_range('8/11/2017', periods=7) 
prat3 = Series(np.arange(7)*100, index=dates2) 
prat3

2017-08-11      0
2017-08-12    100
2017-08-13    200
2017-08-14    300
2017-08-15    400
2017-08-16    500
2017-08-17    600
Freq: D, dtype: int64

### 실습 예제 8번
csv파일을 읽어와 list로 만들어 prat4라는 이름으로 저장하고 prheader, prvalues에 각각 두번째리스트까지, 마지막 리스트까지 값을 넣으시오
그 후 두 리스트 모두 출력해보시오

In [20]:
import csv

In [23]:
prat4  = list(csv.reader(open('data/ex7.csv'))) 
prheader, prvalues = prat4[0:2], prat4[2:]
print(prheader)
print(prvalues)

[['a', 'b', 'c'], ['1', '2', '3']]
[['1', '2', '3', '4']]

### 실습 예제 9번
위에서 만든 con에  ('korea', 'naju', 2017, 8) 라는 데이터를 execute를 활용하여 넣고 리스트형식으로 출력해보시오.

In [32]:
import sqlite3 
                #query라는 데이터베이스 테이블을 만든다.
query = """ 
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""

con = sqlite3.connect(':memory:') ## memory라는 db에 접속
con.execute(query) ## 실행할 query문을 괄호안에 넣는다
con.commit() #변경내용을 db에 반영

In [33]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"  

con.executemany(stmt, data)  # executemany는 execute와 다르게 복수개의 데이터를 넣게해준다 
                            # stmt라는 변수를 사용하여 data를 db에 넣고 변경내용을 db에 반영한다 
con.commit()

In [34]:
import pandas.io.sql as sql

In [36]:
prat5 = ('korea', 'naju', 2017, 8)
con.execute(stmt, prat5)
con.commit()
sql.read_sql('select * from test', con)

             a           b        c  d
0      Atlanta     Georgia     1.25  6
1  Tallahassee     Florida     2.60  3
2   Sacramento  California     1.70  5
3        korea        naju  2017.00  8
4        korea        naju  2017.00  8

추가 자료 데이터 베이스 삭제

In [52]:
con.execute("DELETE FROM test where a=?", ("korea", ))

In [53]:
sql.read_sql('select * from test', con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5